
clc
syms xita1 xita2 xita3;
a = pi/180;         %角度转弧度
b = (1 / pi) * 180;    %弧度转角度

z_offset = 37.5;
d_1 = 37.5;
a_2 = 120;
a_3 = 199;

jie_0 =[1,0,0,0;
        0,1,0,0;
        0,0,1,z_offset;
        0,0,0,1]

jie_1 = jie_0 * [1,0,-1,0;
                 0,1,0,0;
                 1,0,0,0;
                 0,0,0,1]*[1,0,0,0;
                           0,cos(xita1),-sin(xita1),0;
                           0,sin(xita1),cos(xita1),0;
                           0,0,0,1                   ]*[1,0,0,0;
                                                        0,1,0,-d_1;
                                                        0,0,1,0;
                                                        0,0,0,1]

jie_2 = jie_1 * [-sin(xita2),-cos(xita2),0,0;
                 cos(xita2),-sin(xita2),0,0;
                 0,0,1,0;
                 0,0,0,1                   ]*[1,0,0,0;
                                              0,0,-1,0;
                                              0,1,0,0;
                                              0,0,0,1;]*[1,0,0,a_2;
                                                         0,1,0,0;
                                                         0,0,1,0;
                                                         0,0,0,1]


jie_3 = jie_2 * [cos(xita3),-sin(xita3),0,0;
                 sin(xita3),cos(xita3),0,0;
                 0,0,1,0;
                 0,0,0,1                   ]*[1,0,0,0;
                                              0,0,1,0;
                                              0,-1,0,0;
                                              0,0,0,1 ]*[1,0,0,a_3;
                                                         0,1,0,0;
                                                         0,0,1,0;
                                                         0,0,0,1]



% jie_0 =[1,0,0,0;
%         0,1,0,0;
%         0,0,1,z_offset;
%         0,0,0,1]
% 
% jie_1 = jie_0 * [1,0,0,0;
%                  0,0,1,0;
%                  0,-1,0,0;
%                  0,0,0,1]*[cos(xita1),0,sin(xita1),0;
%                            0,1,0,0;
%                            -sin(xita1),0,cos(xita1),0;
%                            0,0,0,1                   ]*[1,0,0,0;
%                                                         0,1,0,-d_1;
%                                                         0,0,1,0;
%                                                         0,0,0,1]
% 
% jie_2 = jie_1 * [cos(xita2),-sin(xita2),0,0;
%                  sin(xita2),cos(xita2),0,0;
%                  0,0,1,0;
%                  0,0,0,1                   ]*[1,0,0,0;
%                                               0,0,1,0;
%                                               0,-1,0,0;
%                                               0,0,0,1;]*[1,0,0,a_2;
%                                                          0,1,0,0;
%                                                          0,0,1,0;
%                                                          0,0,0,1]
% 
% 
% jie_3 = jie_2 * [cos(xita3),-sin(xita3),0,0;
%                  sin(xita3),cos(xita3),0,0;
%                  0,0,1,0;
%                  0,0,0,1                   ]*[1,0,0,0;
%                                               0,0,1,0;
%                                               0,-1,0,0;
%                                               0,0,0,1 ]*[1,0,0,a_3;
%                                                          0,1,0,0;
%                                                          0,0,1,0;
%                                                          0,0,0,1]



%前Keil后Mat,X:Z,Y:Y,Z:X
%t:目标
%目标坐标250.795 -54.204 -72.250
x_t = 102.25;
y_t = 165;
z_t = 40;

%转到目标点平面的XY轴
%t_x = atan2(y_t,x_t) * b
%t_y = z_t

%目标点xy到2轴距离，跟z轴上的距离组成直角三角形可求得目标点与2轴的距离
t_xy = sqrt(x_t^2+y_t^2);
%目标点xz到2轴距离
t_xz = sqrt(x_t^2+z_t^2);
%目标点与2轴在z轴的差距，2轴本身被1轴抬高了37.5
t_z = 37.5 - (z_t);
%目标点到2轴的距离
t_L = sqrt(t_xy^2+t_z^2);

%直接用目标点平面和2轴平面算夹角是错的
%acos(t_xy/t_L)*b

%余弦定理求转角
xita_3 = 180-acos((t_L^2-a_2^2-a_3^2)/(-2*a_2*a_3))*b
c3 = -(t_L^2-a_2^2-a_3^2)/(-2*a_2*a_3);
s3 = sqrt(1-c3^2);

%z_t = 120*cos(xita2) + 199*cos(xita2)*cos(xita3)
s2 = (z_t-37.5)/(-120-199*cos(xita_3*a));
c2 = sqrt(1-s2^2);
xita_2 = asin(s2)*b

k = 120*c2-37.5+199*c2*c3
j = 199*s3

kk = 120*c2+199*c2*c3

p = [kk^2+j^2,-2*kk*y_t,y_t^2-j^2]
r = roots(p)
acos(r)*b
